In [120]:
# imports
import env
import seaborn as sns
import pandas as pd

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
import pydataset

# ignore warnings
import warnings
warnings.filterwarnings("ignore")

1. Use the pydataset module to load the iris data set into a dataframe, `df_iris`
    * print the first 3 rows
    * print the number of rows and columns (shape)
    * print the column names
    * print the data type of each column
    * print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [121]:
df_iris = pydataset.data('iris')

In [124]:
df_iris.columns = [col.lower().replace('.', '_') for col in df_iris]

In [125]:
print(df_iris.head(3))

   sepal_length  sepal_width  petal_length  petal_width species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [25]:
print(df_iris.shape)

(150, 5)

In [24]:
print(df_iris.columns)

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [23]:
print(df_iris.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal_length    150 non-null float64
sepal_width     150 non-null float64
petal_length    150 non-null float64
petal_width     150 non-null float64
species         150 non-null object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB
None

In [27]:
print(df_iris.describe())

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### I don't think that rescaling is needed as they all look fairly descriptive and narrow enough to use.

2. Read the data tab from the stats module dataset, Excel_Stats.xlsx, into a dataframe, `df_excel`
    * assign the first 100 rows to a new dataframe, `df_excel_sample`
    * print the number of rows of your original dataframe
    * print the first 5 column names
    * print the column names that have a data type of `object`
    * compute the range for each of the numeric variables.

In [21]:
path = '~/Excel Docs/OrionWills-ExcelStats.xlsx'
df_excel = pd.read_excel(path, sheet_name='Data')

In [28]:
df_excel_sample = pd.read_excel(path, sheet_name='Data', nrows=100)

In [30]:
df_excel_sample.shape

(100, 14)

In [33]:
print(len(df_excel))

7043

In [37]:
df_excel.columns[0:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [60]:
df_excel.select_dtypes(include=['object']).columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [42]:
df_range = df_excel.select_dtypes(include=['int64', 'float64'])

In [51]:
for col in df_range:
    print(f'Range of {col}: {df_range[col].max() - df_range[col].min()}')

Range of is_senior_citizen: 1
Range of tenure: 72
Range of phone_service: 2
Range of internet_service: 2
Range of contract_type: 2
Range of monthly_charges: 100.5
Range of total_charges: 8666.0
Range of Unnamed: 13: 0.0

#### 3. Read train.csv from google drive (shared through classroom in topic 'Classification') into a dataframe labeled `df_google`
    * print the first 3 rows
    * print the number of rows and columns
    * print the column names
    * print the data type of each column
    * print the summary statistics for each of the numeric variables
    * print the unique values for each of your categorical variables

In [52]:
df_google = pd.read_clipboard(sep='\t')

In [53]:
df_google.head(3)

,rowid,date,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
0,1,2015-02-04 17:51:00,23.18,27.2720,426.0,721.25,0.004793,1
1,2,2015-02-04 17:51:59,23.15,27.2675,429.5,714.00,0.004783,1
2,3,2015-02-04 17:53:00,23.15,27.2450,426.0,713.50,0.004779,1

In [54]:
df_google.shape

(8143, 8)

In [55]:
df_google.columns

Index(['rowid', 'date', 'Temperature', 'Humidity', 'Light', 'CO2',
       'HumidityRatio', 'Occupancy'],
      dtype='object')

In [56]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8143 entries, 0 to 8142
Data columns (total 8 columns):
rowid            8143 non-null int64
date             8143 non-null object
Temperature      8143 non-null float64
Humidity         8143 non-null float64
Light            8143 non-null float64
CO2              8143 non-null float64
HumidityRatio    8143 non-null float64
Occupancy        8143 non-null int64
dtypes: float64(5), int64(2), object(1)
memory usage: 509.0+ KB

In [57]:
df_google.describe()

,rowid,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
count,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000
mean,4072.000000,20.619084,25.731507,119.519375,606.546243,0.003863,0.212330
std,2350.825954,1.016916,5.531211,194.755805,314.320877,0.000852,0.408982
min,1.000000,19.000000,16.745000,0.000000,412.750000,0.002674,0.000000
25%,2036.500000,19.700000,20.200000,0.000000,439.000000,0.003078,0.000000
50%,4072.000000,20.390000,26.222500,0.000000,453.500000,0.003801,0.000000
75%,6107.500000,21.390000,30.533333,256.375000,638.833333,0.004352,0.000000
max,8143.000000,23.180000,39.117500,1546.333333,2028.500000,0.006476,1.000000

In [99]:
unique_catas = df_google[['Occupancy']]

In [100]:
for col in unique_catas:
    print(f'Uniques in {col} = {unique_catas[col].unique()}')

Uniques in Occupancy = [1 0]

4. In mysql workbench or a terminal, write a query to select all the columns of titanic_db.passengers. Export that table to a csv you store locally. Read that csv into a dataframe `df_csv`.
    * print the head and tail of your new dataframe
    * print the number of rows and columns
    * print the column names
    * print the data type of each column
    * print the summary statistics for each numeric variable
    * print the unique values for each categorical variables. If there are more than 5 distince values, print the top 5 in terms of prevelence or frequency.

In [70]:
df_csv = pd.read_csv('titanic_passengers.csv')

In [80]:
head_tail = df_csv.head().append(df_csv.tail())
head_tail

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1
886,886,0,2,male,27.0,0,0,13.0000,S,Second,NaN,Southampton,1
887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.4500,S,Third,NaN,Southampton,0
889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,NaN,Queenstown,1

In [81]:
df_csv.shape

(891, 13)

In [82]:
df_csv.columns

Index(['passenger_id', 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch',
       'fare', 'embarked', 'class', 'deck', 'embark_town', 'alone'],
      dtype='object')

In [83]:
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
passenger_id    891 non-null int64
survived        891 non-null int64
pclass          891 non-null int64
sex             891 non-null object
age             714 non-null float64
sibsp           891 non-null int64
parch           891 non-null int64
fare            891 non-null float64
embarked        889 non-null object
class           891 non-null object
deck            203 non-null object
embark_town     889 non-null object
alone           891 non-null int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [84]:
df_csv.describe()

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,445.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,0.602694
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,0.489615
min,0.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,222.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,445.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,1.000000
75%,667.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,890.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

In [102]:
df_csv2 = df_csv.drop(columns=(['passenger_id', 'age', 'fare']))

In [126]:
for col in df_csv2:
    if len(df_csv2[col].value_counts()) > 5:
        print(df_csv2[col].value_counts()[:5])
    else:
        print(df_csv2[col].value_counts())

0    549
1    342
Name: survived, dtype: int64
3    491
1    216
2    184
Name: pclass, dtype: int64
male      577
female    314
Name: sex, dtype: int64
0    608
1    209
2     28
4     18
3     16
Name: sibsp, dtype: int64
0    678
1    118
2     80
5      5
3      5
Name: parch, dtype: int64
S    644
C    168
Q     77
Name: embarked, dtype: int64
Third     491
First     216
Second    184
Name: class, dtype: int64
C    59
B    47
D    33
E    32
A    15
Name: deck, dtype: int64
Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64
1    537
0    354
Name: alone, dtype: int64